{
  "feature_specs": {
    "bar": 128,
    "cadence_zone": 2,
    "consonance": 4,
    "fragment_contour_bucket": 11,
    "fragment_rhythm_bucket": 10,
    "key_pc": 13,
    "mode": 3,
    "phrase_pos": 8,
    "phrase_role": 10,
    "plan_bass_oct": 11,
    "plan_bass_pc": 13,
    "plan_cadence_zone": 2,
    "plan_final_interval_class": 13,
    "plan_mean_vertical": 50,
    "plan_phrase_pos": 8,
    "plan_top_oct": 11,
    "plan_top_pc": 13,
    "plan_v0_density": 17,
    "plan_v1_density": 17,
    "pos": 32,
    "spacing": 50,
    "v0_degree": 13,
    "v0_dur": 33,
    "v0_mel": 50,
    "v0_pitch": 129,
    "v0_state": 3,
    "v0_tie": 2,
    "v1_degree": 13,
    "v1_dur": 33,
    "v1_mel": 50,
    "v1_pitch": 129,
    "v1_state": 3,
    "v1_tie": 2,
    "vertical_interval": 50,
    "voice_count": 5
  },
  "field_names": [
    "bar",
    "pos",
    "phrase_pos",
    "cadence_zone",
    "key_pc",
    "mode",
    "voice_count",
    "v0_state",
    "v0_pitch",
    "v0_mel",
    "v0_dur",
    "v0_tie",
    "v0_degree",
    "v1_state",
    "v1_pitch",
    "v1_mel",
    "v1_dur",
    "v1_tie",
    "v1_degree",
    "vertical_interval",
    "consonance",
    "spacing",
    "plan_phrase_pos",
    "plan_cadence_zone",
    "plan_bass_pc",
    "plan_top_pc",
    "plan_bass_oct",
    "plan_top_oct",
    "plan_v0_density",
    "plan_v1_density",
    "plan_mean_vertical",
    "plan_final_interval_class",
    "phrase_role",
    "fragment_contour_bucket",
    "fragment_rhythm_bucket"
  ],
  "fragment_contour_bucket": {
    "ARCH": 6,
    "ASCENDING_LEAPY": 4,
    "ASCENDING_STEPWISE": 2,
    "DESCENDING_LEAPY": 5,
    "DESCENDING_STEPWISE": 3,
    "INVERTED_ARCH": 7,
    "MIXED": 10,
    "REPEATED_NOTE": 9,
    "STATIC": 1,
    "UNKNOWN": 0,
    "ZIGZAG": 8
  },
  "fragment_rhythm_bucket": {
    "DOTTED": 6,
    "EVEN_16THS": 1,
    "EVEN_8THS": 2,
    "EVEN_QUARTERS": 3,
    "LONG_SHORT": 4,
    "MIXED": 9,
    "SHORT_LONG": 5,
    "SUSPENSION": 8,
    "SYNCOPATED": 7,
    "UNKNOWN": 0
  },
  "phrase_role": {
    "ANSWER_ENTRY": 3,
    "CADENCE": 8,
    "CADENTIAL_PREP": 7,
    "CLOSING": 9,
    "COUNTERSUBJECT": 4,
    "EPISODE": 5,
    "OPENING": 1,
    "SEQUENCE": 6,
    "SUBJECT_ENTRY": 2,
    "UNKNOWN": 0
  }
}