{
  "<pad>": 0,
  "<unk>": 1,
  "BAR": 2,
  "STYLE_CHORALE": 3,
  "KEY_F": 4,
  "TIME_2_2": 5,
  "TEXTURE_4": 6,
  "POS_0": 7,
  "BASS_52": 8,
  "TENOR_60": 9,
  "ALTO_67": 10,
  "SOP_70": 11,
  "DUR_24": 12,
  "POS_24": 13,
  "BASS_48": 14,
  "POS_48": 15,
  "BASS_53": 16,
  "ALTO_65": 17,
  "SOP_69": 18,
  "POS_72": 19,
  "TENOR_58": 20,
  "SOP_72": 21,
  "BASS_57": 22,
  "ALTO_60": 23,
  "BASS_50": 24,
  "TENOR_57": 25,
  "SOP_74": 26,
  "BASS_55": 27,
  "ALTO_62": 28,
  "ALTO_57": 29,
  "SOP_77": 30,
  "SOP_76": 31,
  "BASS_36": 32,
  "TENOR_62": 33,
  "TENOR_53": 34,
  "BASS_46": 35,
  "TENOR_65": 36,
  "ALTO_69": 37,
  "ALTO_72": 38,
  "ALTO_70": 39,
  "SOP_75": 40,
  "BASS_41": 41,
  "BASS_60": 42,
  "ALTO_64": 43,
  "ALTO_63": 44,
  "SOP_65": 45,
  "BASS_58": 46,
  "SOP_64": 47,
  "SOP_63": 48,
  "ALTO_58": 49,
  "SOP_62": 50,
  "TENOR_55": 51,
  "SOP_60": 52,
  "KEY_G": 53,
  "BASS_64": 54,
  "TENOR_67": 55,
  "ALTO_73": 56,
  "BASS_59": 57,
  "TENOR_66": 58,
  "ALTO_74": 59,
  "SOP_78": 60,
  "TENOR_64": 61,
  "DUR_12": 62,
  "POS_36": 63,
  "ALTO_71": 64,
  "ALTO_66": 65,
  "TENOR_59": 66,
  "SOP_71": 67,
  "SOP_83": 68,
  "BASS_47": 69,
  "TENOR_61": 70,
  "SOP_81": 71,
  "BASS_54": 72,
  "SOP_79": 73,
  "POS_84": 74,
  "DUR_48": 75,
  "BASS_43": 76,
  "ALTO_76": 77,
  "TENOR_48": 78,
  "TENOR_54": 79,
  "SOP_67": 80,
  "TENOR_52": 81,
  "SOP_66": 82,
  "KEY_Bb": 83,
  "TIME_4_4": 84,
  "BASS_62": 85,
  "BASS_51": 86,
  "POS_12": 87,
  "DUR_6": 88,
  "POS_18": 89,
  "POS_60": 90,
  "ALTO_59": 91,
  "BASS_49": 92,
  "BASS_45": 93,
  "ALTO_55": 94,
  "TENOR_56": 95,
  "TENOR_50": 96,
  "ALTO_56": 97,
  "BASS_38": 98,
  "ALTO_54": 99,
  "SOP_57": 100,
  "DUR_96": 101,
  "TIME_3_2": 102,
  "POS_96": 103,
  "POS_108": 104,
  "POS_120": 105,
  "POS_132": 106,
  "POS_42": 107,
  "TIME_2_4": 108,
  "POS_30": 109,
  "POS_6": 110,
  "DUR_3": 111,
  "POS_9": 112,
  "TENOR_47": 113,
  "TENOR_45": 114,
  "BASS_42": 115,
  "TENOR_43": 116,
  "TENOR_63": 117,
  "ALTO_68": 118,
  "SOP_73": 119,
  "ALTO_61": 120,
  "POS_54": 121,
  "POS_66": 122,
  "POS_78": 123,
  "POS_90": 124,
  "SOP_59": 125,
  "POS_57": 126,
  "POS_81": 127,
  "POS_93": 128,
  "KEY_Eb": 129,
  "SOP_58": 130,
  "ALTO_53": 131,
  "SOP_55": 132,
  "BASS_44": 133,
  "ALTO_51": 134,
  "SOP_56": 135,
  "SOP_53": 136,
  "SOP_51": 137,
  "ALTO_50": 138,
  "BASS_39": 139,
  "TENOR_51": 140,
  "BASS_40": 141,
  "SOP_61": 142,
  "ALTO_52": 143,
  "TENOR_49": 144,
  "SOP_54": 145,
  "TENOR_46": 146,
  "ALTO_48": 147,
  "ALTO_46": 148,
  "KEY_C": 149,
  "POS_8": 150,
  "DUR_8": 151,
  "POS_56": 152,
  "POS_64": 153,
  "POS_80": 154,
  "POS_88": 155,
  "POS_16": 156,
  "DUR_18": 157,
  "DUR_2": 158,
  "POS_20": 159,
  "POS_22": 160,
  "DUR_30": 161,
  "SOP_68": 162,
  "TENOR_68": 163,
  "DUR_36": 164,
  "BASS_56": 165,
  "POS_51": 166,
  "POS_75": 167,
  "KEY_D": 168,
  "DUR_27": 169,
  "POS_46": 170,
  "TENOR_73": 171,
  "SOP_50": 172,
  "DUR_72": 173,
  "DUR_144": 174,
  "TIME_9_8": 175,
  "DUR_108": 176,
  "BASS_61": 177,
  "POS_39": 178,
  "DUR_40": 179,
  "POS_45": 180,
  "POS_63": 181,
  "POS_69": 182,
  "POS_87": 183,
  "POS_3": 184,
  "POS_15": 185,
  "POS_21": 186,
  "DUR_4": 187,
  "POS_4": 188,
  "POS_40": 189,
  "POS_44": 190,
  "POS_52": 191,
  "POS_92": 192,
  "KEY_Ab": 193,
  "TENOR_76": 194,
  "TENOR_74": 195,
  "TENOR_69": 196,
  "TENOR_41": 197,
  "TIME_6_4": 198,
  "SOP_80": 199,
  "SOP_84": 200,
  "SOP_82": 201,
  "TENOR_71": 202,
  "ALTO_75": 203,
  "TENOR_72": 204,
  "TIME_3_8": 205,
  "POS_27": 206,
  "POS_33": 207,
  "DUR_9": 208,
  "DUR_16": 209,
  "POS_32": 210,
  "DUR_1": 211,
  "POS_70": 212,
  "TENOR_42": 213,
  "TIME_3_4": 214,
  "POS_68": 215,
  "POS_138": 216,
  "ALTO_78": 217,
  "ALTO_79": 218,
  "TIME_12_8": 219,
  "TENOR_38": 220,
  "POS_28": 221,
  "POS_58": 222,
  "POS_82": 223,
  "POS_94": 224,
  "BASS_65": 225,
  "TENOR_40": 226,
  "ALTO_77": 227,
  "TENOR_36": 228,
  "TENOR_70": 229,
  "DUR_120": 230,
  "DUR_102": 231,
  "POS_102": 232,
  "POS_114": 233,
  "POS_126": 234,
  "DUR_60": 235,
  "POS_141": 236,
  "TIME_4_2": 237,
  "POS_144": 238,
  "POS_168": 239,
  "POS_180": 240,
  "DUR_192": 241,
  "POS_76": 242,
  "KEY_A": 243,
  "TIME_6_8": 244,
  "DUR_51": 245,
  "DUR_54": 246,
  "ALTO_81": 247,
  "ALTO_83": 248,
  "BASS_67": 249,
  "POS_34": 250,
  "BASS_37": 251,
  "TENOR_75": 252,
  "KEY_E": 253,
  "BASS_63": 254,
  "BASS_70": 255,
  "KEY_Dm": 256,
  "DUR_15": 257,
  "ALTO_47": 258,
  "SOP_52": 259,
  "DUR_39": 260,
  "SOP_86": 261,
  "TENOR_81": 262,
  "ALTO_84": 263,
  "POS_17": 264,
  "POS_19": 265,
  "POS_156": 266,
  "TENOR_44": 267,
  "BASS_72": 268,
  "BASS_69": 269,
  "DUR_132": 270,
  "SOP_85": 271,
  "SOP_88": 272,
  "BASS_66": 273,
  "SOP_90": 274,
  "BASS_68": 275,
  "BASS_71": 276,
  "ALTO_86": 277,
  "BASS_73": 278,
  "TENOR_78": 279,
  "BASS_74": 280,
  "TENOR_77": 281,
  "ALTO_80": 282,
  "ALTO_85": 283,
  "ALTO_82": 284,
  "POS_10": 285,
  "DUR_42": 286,
  "DUR_14": 287,
  "POS_50": 288,
  "POS_53": 289,
  "DUR_21": 290,
  "DUR_57": 291,
  "DUR_45": 292,
  "DUR_63": 293,
  "SOP_87": 294,
  "BASS_35": 295,
  "POS_123": 296,
  "POS_129": 297,
  "POS_99": 298,
  "POS_105": 299,
  "TENOR_79": 300,
  "BASS_33": 301,
  "BASS_31": 302,
  "BASS_34": 303,
  "BASS_32": 304,
  "DUR_84": 305,
  "SOP_91": 306,
  "BASS_26": 307,
  "POS_117": 308,
  "TENOR_80": 309,
  "DUR_88": 310,
  "SOP_89": 311,
  "BASS_29": 312,
  "ALTO_43": 313,
  "BASS_27": 314,
  "TENOR_39": 315,
  "ALTO_41": 316,
  "ALTO_49": 317,
  "BASS_24": 318,
  "BASS_22": 319,
  "TENOR_34": 320,
  "POS_111": 321,
  "POS_135": 322,
  "POS_124": 323,
  "POS_128": 324,
  "POS_136": 325,
  "POS_140": 326,
  "POS_71": 327,
  "TENOR_37": 328,
  "TENOR_82": 329,
  "BASS_76": 330,
  "BASS_78": 331,
  "BASS_75": 332,
  "TIME_9_16": 333,
  "ALTO_45": 334,
  "DUR_75": 335,
  "POS_38": 336,
  "POS_14": 337,
  "DUR_33": 338,
  "SOP_48": 339,
  "KEY_C#": 340,
  "KEY_Gb": 341,
  "KEY_F#": 342,
  "TIME_12_16": 343,
  "TIME_24_16": 344,
  "KEY_B": 345,
  "KEY_Db": 346,
  "ALTO_44": 347,
  "SOP_47": 348,
  "POS_55": 349,
  "POS_62": 350,
  "POS_67": 351,
  "POS_74": 352,
  "POS_79": 353,
  "POS_86": 354,
  "POS_91": 355,
  "POS_5": 356,
  "POS_29": 357,
  "POS_41": 358,
  "POS_65": 359,
  "POS_77": 360,
  "POS_89": 361,
  "POS_104": 362,
  "POS_112": 363,
  "DUR_81": 364,
  "DUR_78": 365,
  "DUR_66": 366,
  "POS_43": 367,
  "POS_49": 368,
  "POS_73": 369,
  "DUR_32": 370,
  "POS_83": 371,
  "POS_11": 372,
  "SOP_93": 373,
  "ALTO_42": 374,
  "BASS_25": 375,
  "TENOR_83": 376,
  "BASS_77": 377,
  "ALTO_88": 378,
  "POS_130": 379,
  "DUR_10": 380,
  "DUR_5": 381,
  "POS_2": 382,
  "DUR_20": 383,
  "POS_26": 384,
  "POS_100": 385,
  "POS_116": 386,
  "DUR_7": 387,
  "SOP_49": 388,
  "TENOR_85": 389,
  "BASS_79": 390,
  "TIME_1_4": 391
}