{
  "<pad>": 0,
  "<unk>": 1,
  "BAR": 2,
  "STYLE_CHORALE": 3,
  "KEY_D": 4,
  "TIME_4_4": 5,
  "TEXTURE_4": 6,
  "POS_72": 7,
  "BASS_50": 8,
  "TENOR_57": 9,
  "ALTO_66": 10,
  "SOP_74": 11,
  "DUR_12": 12,
  "POS_84": 13,
  "BASS_52": 14,
  "ALTO_67": 15,
  "POS_24": 16,
  "BASS_55": 17,
  "TENOR_62": 18,
  "SOP_71": 19,
  "POS_36": 20,
  "SOP_73": 21,
  "POS_48": 22,
  "BASS_54": 23,
  "ALTO_69": 24,
  "POS_60": 25,
  "SOP_76": 26,
  "ALTO_70": 27,
  "SOP_78": 28,
  "BASS_56": 29,
  "ALTO_71": 30,
  "POS_0": 31,
  "BASS_58": 32,
  "TENOR_61": 33,
  "ALTO_73": 34,
  "DUR_24": 35,
  "BASS_59": 36,
  "BASS_57": 37,
  "TENOR_59": 38,
  "ALTO_64": 39,
  "DUR_72": 40,
  "BASS_76": 41,
  "TENOR_69": 42,
  "ALTO_57": 43,
  "SOP_61": 44,
  "POS_12": 45,
  "TENOR_67": 46,
  "BASS_74": 47,
  "TENOR_66": 48,
  "ALTO_59": 49,
  "SOP_62": 50,
  "BASS_73": 51,
  "TENOR_64": 52,
  "ALTO_52": 53,
  "SOP_67": 54,
  "BASS_71": 55,
  "BASS_69": 56,
  "ALTO_54": 57,
  "SOP_66": 58,
  "ALTO_50": 59,
  "TENOR_58": 60,
  "ALTO_49": 61,
  "ALTO_47": 62,
  "ALTO_46": 63,
  "SOP_68": 64,
  "SOP_70": 65,
  "ALTO_55": 66,
  "SOP_69": 67,
  "SOP_64": 68,
  "ALTO_78": 69,
  "TENOR_52": 70,
  "ALTO_79": 71,
  "SOP_59": 72,
  "ALTO_76": 73,
  "SOP_57": 74,
  "SOP_50": 75,
  "BASS_67": 76,
  "TENOR_55": 77,
  "ALTO_74": 78,
  "TENOR_54": 79,
  "BASS_66": 80,
  "TENOR_46": 81,
  "TENOR_47": 82,
  "TENOR_78": 83,
  "BASS_64": 84,
  "TENOR_79": 85,
  "TENOR_76": 86,
  "BASS_62": 87,
  "TENOR_74": 88,
  "BASS_61": 89,
  "SOP_55": 90,
  "SOP_54": 91,
  "SOP_52": 92,
  "SOP_51": 93,
  "TENOR_71": 94,
  "DUR_48": 95,
  "SOP_47": 96,
  "TENOR_73": 97,
  "ALTO_65": 98,
  "SOP_49": 99,
  "ALTO_68": 100,
  "SOP_53": 101,
  "DUR_6": 102,
  "POS_90": 103,
  "BASS_45": 104,
  "ALTO_62": 105,
  "ALTO_61": 106,
  "KEY_G": 107,
  "BASS_43": 108,
  "KEY_C": 109,
  "TENOR_60": 110,
  "BASS_60": 111,
  "TENOR_56": 112,
  "SOP_72": 113,
  "TENOR_45": 114,
  "ALTO_56": 115,
  "BASS_53": 116,
  "SOP_60": 117,
  "TENOR_68": 118,
  "BASS_48": 119,
  "ALTO_60": 120,
  "BASS_47": 121,
  "BASS_44": 122,
  "TENOR_72": 123,
  "TENOR_65": 124,
  "BASS_49": 125,
  "SOP_65": 126,
  "BASS_46": 127,
  "BASS_41": 128,
  "ALTO_53": 129,
  "BASS_40": 130,
  "BASS_38": 131,
  "ALTO_58": 132,
  "BASS_37": 133,
  "POS_66": 134,
  "SOP_58": 135,
  "POS_42": 136,
  "BASS_72": 137,
  "TENOR_48": 138,
  "BASS_65": 139,
  "TENOR_50": 140,
  "TENOR_53": 141,
  "POS_18": 142,
  "TENOR_70": 143,
  "ALTO_63": 144,
  "TENOR_63": 145,
  "BASS_70": 146,
  "ALTO_48": 147,
  "ALTO_38": 148,
  "ALTO_43": 149,
  "SOP_63": 150,
  "KEY_F": 151,
  "TIME_3_4": 152,
  "ALTO_72": 153,
  "ALTO_77": 154,
  "TENOR_41": 155,
  "TENOR_43": 156,
  "TENOR_77": 157,
  "ALTO_45": 158,
  "SOP_48": 159,
  "BASS_77": 160,
  "SOP_43": 161,
  "SOP_45": 162,
  "SOP_41": 163,
  "SOP_46": 164,
  "KEY_Bb": 165,
  "TENOR_75": 166,
  "BASS_51": 167,
  "ALTO_41": 168,
  "ALTO_51": 169,
  "BASS_42": 170,
  "POS_30": 171,
  "BASS_63": 172,
  "ALTO_42": 173,
  "KEY_A": 174,
  "BASS_78": 175,
  "BASS_68": 176,
  "POS_6": 177,
  "SOP_56": 178,
  "POS_78": 179,
  "POS_54": 180,
  "TENOR_49": 181,
  "TENOR_51": 182,
  "ALTO_44": 183,
  "ALTO_75": 184,
  "DUR_96": 185,
  "TENOR_36": 186,
  "SOP_44": 187,
  "SOP_77": 188,
  "SOP_79": 189,
  "SOP_36": 190,
  "TENOR_40": 191,
  "SOP_38": 192,
  "ALTO_40": 193,
  "TENOR_38": 194,
  "TENOR_44": 195
}